In [1]:
import pandas as pd
df = pd.read_csv("./data/diamonds.csv")
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [2]:
def minmax(x):
    result = (x - x.min()) / (x.max() - x.min())
    return result

In [3]:
minmax(pd.Series([-5 , 1, 6, 7, 100]))

0    0.000000
1    0.057143
2    0.104762
3    0.114286
4    1.000000
dtype: float64

In [5]:
df = pd.DataFrame({"origin": [-5, 1, 6, 7, 100]})
df

   origin
0      -5
1       1
2       6
3       7
4     100

In [6]:
df["nor_minmax"] = minmax(df["origin"])
df

   origin  nor_minmax
0      -5    0.000000
1       1    0.057143
2       6    0.104762
3       7    0.114286
4     100    1.000000